Revit 2027 API
Units.DecimalSymbol Property
 The symbol used to separate the integer and fractional parts of a number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DecimalSymbol DecimalSymbol { get; set; }
Public Property DecimalSymbol As DecimalSymbol
	Get
	Set
public:
property DecimalSymbol DecimalSymbol {
	DecimalSymbol get ();
	void set (DecimalSymbol value);
}
member DecimalSymbol : DecimalSymbol with get, set
Property Value
DecimalSymbol
 The decimal symbol. The default is Dot.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace